{
  "title": "Advanced Tips & Strategies for Bottle Flip",
  "tips": [
    {
      "subtitle": "Master Single and Double Jumps",
      "description": "This game has two jump types: single tap for a short hop, double tap for a higher jump. Practice the timing between taps for double jumps—too fast and it won't register, too slow and you get two separate single jumps. Most short platforms need single jumps, while longer gaps or higher surfaces require double jumps. Start each level by testing which jump type works best for the distance."
    },
    {
      "subtitle": "Perfect Your Tap Timing",
      "description": "Success comes from tapping at the right moment, not how hard you press. Watch the bottle's position and the target platform, then tap when the bottle is aligned for a clean arc. For double jumps, the second tap should come just as the bottle reaches the peak of its first hop. Consistent timing beats random tapping every time."
    },
    {
      "subtitle": "Aim for Platform Centers",
      "description": "Always target the middle of platforms for stable landings. Edges cause bounces and slips. On narrow surfaces, aim slightly toward the back half to account for the bottle's forward momentum. Wide platforms give you more room for error, but center shots are still safest. A good landing in the middle beats a risky edge attempt."
    },
    {
      "subtitle": "Study Each Level Layout",
      "description": "Before your first jump, examine the platform arrangement. Look for moving platforms, obstacles, or tricky angles. Some platforms tilt or move—time your taps so the bottle lands when they're in the best position. Notice any objects that might block the bottle's path. A few seconds of planning prevents many failed attempts."
    },
    {
      "subtitle": "Choose the Right Jump Type",
      "description": "Single jumps work for close platforms and low hops. Double jumps are for longer distances and higher surfaces. Don't use double jumps on short gaps—you'll overshoot. Don't use single jumps on long gaps—you'll fall short. Match the jump type to the distance, and you'll land more consistently."
    },
    {
      "subtitle": "Stay Calm When You Miss",
      "description": "Missing several jumps in a row is normal. Take a breath and reset your focus. Don't tap faster out of frustration—this usually makes things worse. Instead, go back to basics: study the gap, choose single or double jump, aim for the center, and tap with steady timing. Sometimes a short break helps clear your head."
    },
    {
      "subtitle": "Build Consistent Habits",
      "description": "Develop reliable tapping technique and stick with it. Use the same finger position each time. Keep your device steady and comfortable. Practice the rhythm: look, choose jump type, aim, tap. Repeat this sequence until it becomes automatic. Consistency in your bottle flip technique leads to better scores."
    },
    {
      "subtitle": "Optimize Your Setup",
      "description": "Make sure you're comfortable before starting. On mobile, hold your device steady and use your preferred finger for tapping. On desktop, position your mouse where it feels natural. Good lighting helps you see platforms clearly. Close unnecessary apps to prevent lag. Smooth, responsive controls make bottle flip challenges much easier."
    }
  ]
}
