{
  "title": "Advanced Tips & Strategies for Bottle Flip",
  "tips": [
    {
      "subtitle": "Find Your Tap Rhythm",
      "description": "This game uses a fixed jump. Your job isn’t to press harder—it’s to tap at the right moment. Practice a simple loop: observe → align → tap → watch. Keep the tempo steady across attempts so each jump feels the same. Short, calm sessions beat frantic spamming."
    },
    {
      "subtitle": "Tap When Alignment Looks Right",
      "description": "Before you tap, line up the bottle and the target platform in your view. Aim for a clean path with no obstacles above, and tap when the bottle looks roughly upright and the platform center is your natural landing line. Trust visuals, not guesswork."
    },
    {
      "subtitle": "Land the Middle, Avoid Edges",
      "description": "The safest landing zone is the platform center. Edges cause slips and ricochets. On very narrow ledges, favor a touch toward the back half to counter forward carry. If you miss, adjust your timing (earlier or later), not how hard you tap."
    },
    {
      "subtitle": "Read Cycles and Windows",
      "description": "Moving or tilting platforms repeat in cycles. Watch one full cycle, count a beat (1‑2‑3), then tap at the same point next time. For obstacles overhead, wait until the gap opens and tap into the window—one clean decision beats two rushed ones."
    },
    {
      "subtitle": "Reset, Recenter, Then Go",
      "description": "After each landing, let the bottle settle so it’s stable and upright. Recenter your eyes on the next platform, confirm a clear arc, then tap. This tiny pause keeps your rhythm consistent and reduces random misses."
    },
    {
      "subtitle": "Quick Fixes (Timing Only)",
      "description": "Falling short: tap a bit earlier. Overshooting the target zone: tap a bit later. Hitting the underside of an obstacle: wait one beat longer for a bigger opening. Sliding off: aim the visual line toward the platform center. Side drift: tap when the bottle looks upright, not leaning."
    },
    {
      "subtitle": "Build Consistency, Not Tricks",
      "description": "Use the same finger and posture every time. Count a quiet cadence—ready, tap, land. Practice on an easy level until your success rate climbs, then move on. Consistency turns close calls into automatic landings."
    },
    {
      "subtitle": "Comfort = Control",
      "description": "On mobile, hold the phone steady and tap with a comfortable finger. On desktop, use a stable mouse position. Good lighting helps you see platform edges. Close extra tabs/apps to avoid lag—smooth frames make timing easier."
    }
  ]
}
